In [2]:
import pandas as pd

In [3]:
# Use Dict.get("key","No such thing is there ") to avoid getting error if no such key is found 
#for f in dict:
#f here is key 
#dict.values() gives the data part other than key
#dict.keys() give keys
#.join adds whatever you want to a list
#applicable to both strings and list

In [4]:
dic={"A": ["sup"],
     "B": ["How "],
     "C": ["are"],
     "D": ["you doing"]
    }
print(dic.keys())
for x in dic.keys():
    print(dic[x])
print(dic)

dict_keys(['A', 'B', 'C', 'D'])
['sup']
['How ']
['are']
['you doing']
{'A': ['sup'], 'B': ['How '], 'C': ['are'], 'D': ['you doing']}

In [5]:
A="qwe1"
     
B=" "
B = "+".join(A)
print(B)

q+w+e+1

In [6]:
df = pd.DataFrame(dic)
df

     A     B    C          D
0  sup  How   are  you doing

In [7]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [8]:
df.D
#or
df['D']

0    you doing
Name: D, dtype: object

In [9]:
type(df.A)

pandas.core.series.Series

In [10]:
op=pd.read_csv("E:\\fulfilment_center_info2.csv")
op

    center_id  city_code  region_code center_type  op_area
0          11        679           56      TYPE_A      3.7
1          13        590           56      TYPE_B      6.7
2         124        590           56      TYPE_C      4.0
3          66        648           34      TYPE_A      4.1
4          94        632           34      TYPE_C      3.6
..        ...        ...          ...         ...      ...
72         53        590           56      TYPE_A      3.8
73         30        604           56      TYPE_A      3.5
74         76        614           85      TYPE_A      3.0
75         68        676           34      TYPE_B      4.1
76         51        638           56      TYPE_A      7.0

[77 rows x 5 columns]

In [11]:
Q=op[["center_id","city_code"]]
Q["center_id"].max()

186

In [12]:
op.describe()

        center_id   city_code  region_code    op_area
count   77.000000   77.000000    77.000000  77.000000
mean    83.142857  600.662338    56.493506   3.985714
std     46.090219   66.720274    18.126473   1.106406
min     10.000000  456.000000    23.000000   0.900000
25%     50.000000  553.000000    34.000000   3.500000
50%     77.000000  596.000000    56.000000   3.900000
75%    110.000000  651.000000    77.000000   4.400000
max    186.000000  713.000000    93.000000   7.000000

In [13]:
op.head(3)

   center_id  city_code  region_code center_type  op_area
0         11        679           56      TYPE_A      3.7
1         13        590           56      TYPE_B      6.7
2        124        590           56      TYPE_C      4.0

# SELECTING REQUIRED PART OF COLMN
op[(op["center_id"]>180) & (op["region_code"]>55)]

In [14]:

op[(op["center_id"]>180) & (op["center_type"]=="TYPE_A")].city_code

28    649
Name: city_code, dtype: int64

In [15]:
op.set_index("region_code").head()
#use inplace = "True" to permenantly change Data frame

             center_id  city_code center_type  op_area
region_code
56                  11        679      TYPE_A      3.7
56                  13        590      TYPE_B      6.7
56                 124        590      TYPE_C      4.0
34                  66        648      TYPE_A      4.1
34                  94        632      TYPE_C      3.6

In [16]:
D=op.groupby("center_type")

D.agg(["mean","median"])

             center_id          city_code        region_code          op_area  \
                  mean median        mean median        mean median      mean
center_type
TYPE_A       88.325581     83  596.325581    596   57.069767     56  4.076744
TYPE_B       75.400000     67  602.533333    590   54.800000     56  4.773333
TYPE_C       77.526316     80  609.000000    604   56.526316     56  3.157895


            median
center_type
TYPE_A         4.0
TYPE_B         4.4
TYPE_C         3.0

In [17]:
op.head()

   center_id  city_code  region_code center_type  op_area
0         11        679           56      TYPE_A      3.7
1         13        590           56      TYPE_B      6.7
2        124        590           56      TYPE_C      4.0
3         66        648           34      TYPE_A      4.1
4         94        632           34      TYPE_C      3.6

In [18]:
op.columns

Index(['center_id', 'city_code', 'region_code', 'center_type', 'op_area'], dtype='object')

# REMOVING COLUMNS OR ROWS
op.drop(["op_area"],axis=1)#put inplace=True, for rows use dictionary and possitions

In [19]:
op.drop(["op_area"],axis=1)

    center_id  city_code  region_code center_type
0          11        679           56      TYPE_A
1          13        590           56      TYPE_B
2         124        590           56      TYPE_C
3          66        648           34      TYPE_A
4          94        632           34      TYPE_C
..        ...        ...          ...         ...
72         53        590           56      TYPE_A
73         30        604           56      TYPE_A
74         76        614           85      TYPE_A
75         68        676           34      TYPE_B
76         51        638           56      TYPE_A

[77 rows x 4 columns]

# sorting row and colmn

In [20]:
op.head(3)

   center_id  city_code  region_code center_type  op_area
0         11        679           56      TYPE_A      3.7
1         13        590           56      TYPE_B      6.7
2        124        590           56      TYPE_C      4.0

In [21]:
op.dtypes

center_id        int64
city_code        int64
region_code      int64
center_type     object
op_area        float64
dtype: object

# #SORTING

In [22]:
A=op.center_id.sort_values()#could use ascending = False 
print(A)

56     10
0      11
1      13
17     14
69     17
     ...
70    161
52    162
45    174
43    177
28    186
Name: center_id, Length: 77, dtype: int64

In [23]:
op.sort_values("center_id")#put list if 2 or more name are there

    center_id  city_code  region_code center_type  op_area
56         10        590           56      TYPE_B      6.3
0          11        679           56      TYPE_A      3.7
1          13        590           56      TYPE_B      6.7
17         14        654           56      TYPE_C      2.7
69         17        517           56      TYPE_A      3.2
..        ...        ...          ...         ...      ...
70        161        658           34      TYPE_B      3.9
52        162        526           34      TYPE_C      2.0
45        174        700           56      TYPE_A      7.0
43        177        683           56      TYPE_A      3.4
28        186        649           34      TYPE_A      3.4

[77 rows x 5 columns]

In [24]:
op.center_type.describe()

count         77
unique         3
top       TYPE_A
freq          43
Name: center_type, dtype: object

# STRING OPERATION IN DF

In [25]:
op.center_type.str.lower()

0     type_a
1     type_b
2     type_c
3     type_a
4     type_c
       ...
72    type_a
73    type_a
74    type_a
75    type_b
76    type_a
Name: center_type, Length: 77, dtype: object

In [144]:
C=pd.read_csv("http://bit.ly/drinksbycountry").head(3)

In [138]:
C[C.item_name.str.contains("Izze")].head(3)

AttributeError: 'DataFrame' object has no attribute 'item_name'

In [ ]:
 C.item_price = C.item_price.str.replace("$","")
C.head(3)

# CHAANGE DATA TYPE OF SERIES'

In [ ]:
# C.item_price=C.item_price.astype(float)
# C.dtypes

# GROUP_BY

In [150]:
C=pd.read_table("http://bit.ly/chiporders")
C.head(3)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39

In [151]:
M=C.groupby("order_id")
M.agg(["mean","min","max"])

         quantity
             mean min max
order_id
1             1.0   1   1
2             2.0   2   2
3             1.0   1   1
4             1.0   1   1
5             1.0   1   1
...           ...  ..  ..
1830          1.0   1   1
1831          1.0   1   1
1832          1.0   1   1
1833          1.0   1   1
1834          1.0   1   1

[1834 rows x 3 columns]

In [ ]:
A= pd.read_csv("http://bit.ly/imdbratings")
A.head()

In [ ]:
A[A.genre == "Crime"].head(3)

# OPERATION ON SERIES

In [ ]:
A.head(3)

In [ ]:
X=A.genre.value_counts()#its a series
X

In [ ]:
X.Drama

In [ ]:
A.genre.unique()

In [ ]:
pd.crosstab(A.genre,A.content_rating)

In [ ]:
%matplotlib inline

In [ ]:
A.genre.value_counts().plot(kind="bar")

# NULL VALUES

In [2]:
import pandas as pd
ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.head(5)

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [ ]:
ufo[ufo.isnull().City].City

In [3]:
ufo.shape

(18241, 5)

In [4]:
ufo.dropna(how="any").shape #has inplace

(2486, 5)

In [5]:
ufo.dropna(how="all").shape

(18241, 5)

In [ ]:
#filling missind val
ufo.City.fillna(value="Brooklyn",axis=0)

In [ ]:
ufo.City.value_counts(dropna=False).sum()

In [ ]:
ufo.City.fillna(value='brk',inplace=True)

In [ ]:
ufo[ufo.City.str.contains('brk')]

# INDEX OF DF

In [ ]:
D = pd.read_csv("http://bit.ly/drinksbycountry")
D.head(3)

In [ ]:
D.index

In [ ]:
D.set_index("continent",inplace=True)

In [ ]:
D.head()

In [ ]:
D.loc["Africa","country"].head(3)

In [33]:

d = pd.read_csv("http://bit.ly/drinksbycountry")
# d.head(3)
d.set_index("country",inplace=True)
d

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa
...,...,...,...,...,...
Venezuela,333,100,3,7.7,South America
Vietnam,111,2,1,2.0,Asia
Yemen,6,0,0,0.1,Asia
Zambia,32,19,4,2.5,Africa
Zimbabwe,64,18,4,4.7,Africa

In [ ]:
C=D[["country"]]

# Building Series

In [35]:
e=pd.Series([10000,2000000],index=["Algeria","Yemen"],name="POPL")

In [45]:
pd.concat([d,e],axis=1)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,POPL
Afghanistan,0,0,0,0.0,Asia,NaN
Albania,89,132,54,4.9,Europe,NaN
Algeria,25,0,14,0.7,Africa,10000.0
Andorra,245,138,312,12.4,Europe,NaN
Angola,217,57,45,5.9,Africa,NaN
...,...,...,...,...,...,...
Venezuela,333,100,3,7.7,South America,NaN
Vietnam,111,2,1,2.0,Asia,NaN
Yemen,6,0,0,0.1,Asia,2000000.0
Zambia,32,19,4,2.5,Africa,NaN
Zimbabwe,64,18,4,4.7,Africa,NaN

# loc,iloc and ix

In [52]:
X = pd.read_csv('http://bit.ly/uforeports')
X.head(2)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00

In [57]:
X.loc[X.City=="Oakland",:].head(3)#

         City Colors Reported Shape Reported State             Time
1694  Oakland             NaN          CIGAR    CA  7/21/1968 14:00
2144  Oakland             NaN           DISK    CA   8/19/1971 0:00
4686  Oakland             NaN          LIGHT    MD    6/1/1982 0:00

In [58]:
X.loc[X.City=="Oakland","Shape Reported"].head(3)

1694    CIGAR
2144     DISK
4686    LIGHT
Name: Shape Reported, dtype: object

In [68]:
X.loc[0:2,2]#not valid since column heads are strings

TypeError: cannot do label indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [1] of <class 'int'>

In [70]:
#iloc stand for integer loc
#slicing only using numbers
X.iloc[:2,:3]

          City Colors Reported Shape Reported
0       Ithaca             NaN       TRIANGLE
1  Willingboro             NaN          OTHER

In [71]:
#ix i blend//

# Drop

In [72]:
X.drop("Colors Reported",axis=1)

                       City Shape Reported State              Time
0                    Ithaca       TRIANGLE    NY    6/1/1930 22:00
1               Willingboro          OTHER    NJ   6/30/1930 20:00
2                   Holyoke           OVAL    CO   2/15/1931 14:00
3                   Abilene           DISK    KS    6/1/1931 13:00
4      New York Worlds Fair          LIGHT    NY   4/18/1933 19:00
...                     ...            ...   ...               ...
18236            Grant Park       TRIANGLE    IL  12/31/2000 23:00
18237           Spirit Lake           DISK    IA  12/31/2000 23:00
18238           Eagle River            NaN    WI  12/31/2000 23:45
18239           Eagle River          LIGHT    WI  12/31/2000 23:45
18240                  Ybor           OVAL    FL  12/31/2000 23:59

[18241 rows x 4 columns]

# DUMMY VARIABLE

In [76]:
t = pd.read_csv("http://bit.ly/kaggletrain")
t.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [79]:
t["sx"]=t.Sex.map({'female': 0, 'male':1})
t.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sx
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

In [85]:
pd.get_dummies(t.Sex,prefix="Sex").iloc[:,1:].head(2) #concat it with DF

   Sex_male
0         1
1         0

In [87]:
#anothr_way
pd.get_dummies(t,columns = ['Sex','Embarked'],drop_first=True)# removes columns being duplicated auto

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,sx,Sex_male,Embarked_Q,Embarked_S
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,1,1,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,0,0,0,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,0,0,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,0,0,0,1
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",27.0,0,0,211536,13.0000,NaN,1,1,0,1
887,888,1,1,"Graham, Miss. Margaret Edith",19.0,0,0,112053,30.0000,B42,0,0,0,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,1,2,W./C. 6607,23.4500,NaN,0,0,0,1
889,890,1,1,"Behr, Mr. Karl Howell",26.0,0,0,111369,30.0000,C148,1,1,0,0
890,891,0,3,"Dooley, Mr. Patrick",32.0,0,0,370376,7.7500,NaN,1,1,1,0

# DATE AND TIME

In [4]:
import pandas as pd
a1 = pd.read_csv('http://bit.ly/uforeports')
a1.head(2)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00

In [2]:
a1.dtypes

NameError: name 'a1' is not defined

In [ ]:
a1.Time = pd.to_datetime(a1.Time)
a1.dtypes

In [ ]:
a1.Time.dt.hour.head(3)

In [ ]:
a2= pd.to_datetime("16/4/1980")
a2

In [ ]:
a1.loc[a1.Time>a2,:].head()

In [ ]:
a1=a1.sort_values("Time")

In [17]:
a1.iloc[:6,:1].values.shape

(6, 1)

NameError: name 'np' is not defined

In [2]:
import pandas as pd
a1 = pd.read_csv('http://bit.ly/uforeports')
a1.head(2)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00

In [10]:
a1.loc[ a1.City =="Willingboro","City":"State"]

             City Colors Reported Shape Reported State
1     Willingboro             NaN          OTHER    NJ
6499  Willingboro             NaN            NaN    NJ

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [7]:
t = pd.read_csv("http://bit.ly/kaggletrain")
t.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [11]:
t[["Survived","Pclass"]].values

array([[0, 3],
       [1, 1],
       [1, 3],
       ...,
       [0, 3],
       [1, 1],
       [0, 3]], dtype=int64)